{
  "backend/main.mo": "Motoko backend actor defining ServiceType and BookingStatus enums with comparison functions, Booking data structures, and CRUD operations for managing service bookings with in-memory Map storage.",
  "feature_evidence.json": "Feature evidence report mapping five implemented features (booking system, form, list with filters, status updates, and visual theme) to their corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing routing, pages, components, hooks, and styling for the service booking application.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining OKLCH color system for light and dark modes, including sidebar, chart, and theme-specific color tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Service Hub', and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining root layout route and three child routes (home, booking, management) with type-safe router setup and provider.",
  "frontend/src/components/BookingFilters.tsx": "Filter component with two Select dropdowns for filtering bookings by service type (lawn mowing/car wash) and status (pending/confirmed/completed).",
  "frontend/src/components/BookingForm.tsx": "Comprehensive booking form with customer details, service type selection with icons, date picker, address input, validation, and backend integration with success toast and navigation.",
  "frontend/src/components/BookingsList.tsx": "Displays a table of bookings with filtering support, showing service type, date, address, and status with icons and badges. Includes loading, error, and empty states, and integrates BookingStatusUpdate for status changes.",
  "frontend/src/components/BookingStatusUpdate.tsx": "Dropdown menu component for updating booking status with loading state, current status indicator, and toast notifications on success or error.",
  "frontend/src/components/HeroSection.tsx": "Renders a hero banner with gradient background and hero image, supporting both full-height and compact modes for different page layouts.",
  "frontend/src/components/Layout.tsx": "Provides the main application layout with a sticky header containing navigation links, mobile menu toggle, and footer. Uses TanStack Router for navigation and active link highlighting.",
  "frontend/src/components/ServiceCard.tsx": "Displays a service card component with icon, title, and description, styled differently for lawn mowing vs car wash services with hover effects.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, managing identity state and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching bookings with filters, creating new bookings, and updating booking status, all using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming including light/dark mode colors, custom service colors (lawn/wash), and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM.",
  "frontend/src/pages/BookingPage.tsx": "Page component for creating new bookings, displaying a compact hero section and the BookingForm component with instructional text.",
  "frontend/src/pages/BookingsManagementPage.tsx": "Page component for managing bookings with filter controls for service type and status, displaying filtered results in BookingsList.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that displays a hero section, service cards for lawn mowing and car washing, a 'How It Works' section with three steps, and a call-to-action button to book services.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes (including lawn/wash service colors using OKLCH), container settings, border radius variables, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking completed features (booking system, filtering, status updates, UI theme) and pending backend data model implementation, along with image requirements for service icons and hero banner."
}